[
  {
    "bookId": 1,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "great_gatsby.jpg",
    "review": "The Great Gatsby is a mesmerizing tale of love, wealth, and tragedy set against the backdrop of the roaring twenties. F. Scott Fitzgerald's prose captures the extravagance and decadence of the Jazz Age, while delving into the complexities of human desires and relationships. Through the enigmatic Jay Gatsby and the disillusioned narrator, Nick Carraway, Fitzgerald explores themes of longing, identity, and the American Dream. With its rich symbolism and evocative imagery, The Great Gatsby remains a timeless masterpiece.",
    "totalPages": 180,
    "rating": 4.5,
    "category": "Fiction",
    "tags": [
      "Classic",
      "Romance"
    ],
    "publisher": "Scribner",
    "yearOfPublishing": 1925
  },
  {
    "bookId": 2,
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "to_kill_a_mockingbird.jpg",
    "review": "To Kill a Mockingbird is a poignant portrayal of racial injustice and moral growth in the American South. Harper Lee's timeless narrative follows young Scout Finch as she navigates the complexities of race, class, and morality in her small town. Through the character of Atticus Finch, Lee challenges societal norms and advocates for empathy and understanding. With its compelling characters and powerful themes, To Kill a Mockingbird continues to resonate with readers as a testament to the enduring power of compassion and justice.",
    "totalPages": 336,
    "rating": 4.8,
    "category": "Fiction",
    "tags": [
      "Classic",
      "Social Justice"
    ],
    "publisher": "J. B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },
  {
    "bookId": 3,
    "bookName": "1984",
    "author": "George Orwell",
    "image": "1984.jpg",
    "review": "1984 is a chilling dystopian novel that serves as a stark warning against totalitarianism and the erosion of individual freedoms. George Orwell's prophetic narrative paints a bleak picture of a future society ruled by omnipresent surveillance and thought control. Through the protagonist Winston Smith, Orwell explores the dangers of authoritarianism and the manipulation of truth. With its thought-provoking commentary on power and oppression, 1984 remains a hauntingly relevant critique of modern society.",
    "totalPages": 328,
    "rating": 4.6,
    "category": "Fiction",
    "tags": [
      "Dystopian",
      "Political"
    ],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "bookId": 4,
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "catcher_in_the_rye.jpg",
    "review": "The Catcher in the Rye is a seminal coming-of-age novel that captures the angst and alienation of adolescence with raw honesty. J.D. Salinger's iconic protagonist, Holden Caulfield, embarks on a journey of self-discovery as he grapples with the hypocrisy and phoniness of the adult world. Through Holden's cynical yet vulnerable narration, Salinger explores themes of identity, authenticity, and the search for meaning in a superficial society. With its candid portrayal of teenage rebellion and longing for connection, The Catcher in the Rye continues to resonate with readers of all generations.",
    "totalPages": 224,
    "rating": 4.3,
    "category": "Fiction",
    "tags": [
      "Classic",
      "Teenage"
    ],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "bookId": 5,
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "pride_and_prejudice.jpg",
    "review": "Pride and Prejudice is a timeless romantic comedy of manners that satirizes the social conventions of early 19th-century England. Jane Austen's witty and sharp-tongued narrative follows the spirited Elizabeth Bennet as she navigates the pitfalls of love, marriage, and societal expectations. Through the tempestuous relationship between Elizabeth and the enigmatic Mr. Darcy, Austen explores themes of pride, prejudice, and the transformative power of self-awareness. With its sparkling dialogue and memorable characters, Pride and Prejudice remains a beloved classic that continues to enchant readers with its timeless charm.",
    "totalPages": 432,
    "rating": 4.7,
    "category": "Fiction",
    "tags": [
      "Classic",
      "Romance"
    ],
    "publisher": "T. Egerton, Whitehall",
    "yearOfPublishing": 1813
  },
  {
    "bookId": 6,
    "bookName": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "the_hobbit.jpg",
    "review": "The Hobbit is a captivating fantasy adventure that transports readers to the enchanting world of Middle-earth. J.R.R. Tolkien's epic tale follows the unlikely hero Bilbo Baggins as he embarks on a perilous quest to reclaim the lost kingdom of Erebor from the fearsome dragon Smaug. Along the way, Bilbo encounters a diverse cast of characters, from noble dwarves to cunning trolls, each contributing to the rich tapestry of Tolkien's meticulously crafted universe. With its thrilling escapades and timeless themes of courage, friendship, and heroism, The Hobbit continues to captivate audiences of all ages, inviting them on an unforgettable journey through the realms of imagination.",
    "totalPages": 310,
    "rating": 4.9,
    "category": "Fantasy",
    "tags": [
      "Adventure",
      "Quest"
    ],
    "publisher": "Allen & Unwin",
    "yearOfPublishing": 1937
  },
  {
    "bookId": 7,
    "bookName": "The Name of the Wind",
    "author": "Patrick Rothfuss",
    "image": "the_name_of_the_wind.jpg",
    "review": "The Name of the Wind is a captivating fantasy novel that transports readers to the enchanting world of Temerant. Patrick Rothfuss weaves a mesmerizing tale that follows the enigmatic Kvothe as he recounts his journey from a talented young musician to a notorious wizard and adventurer. Through intricate storytelling and rich world-building, Rothfuss paints a vivid picture of a world brimming with magic, intrigue, and danger. With its compelling characters and masterful prose, The Name of the Wind immerses readers in a spellbinding narrative that leaves them eagerly awaiting the next installment.",
    "totalPages": 662,
    "rating": 4.6,
    "category": "Fantasy",
    "tags": [
      "Magic",
      "Adventure"
    ],
    "publisher": "DAW Books",
    "yearOfPublishing": 2007
  },
  {
    "bookId": 8,
    "bookName": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "the_alchemist.jpg",
    "review": "The Alchemist is a captivating tale of self-discovery and spiritual awakening that has inspired millions around the world. Paulo Coelho's allegorical narrative follows Santiago, a young Andalusian shepherd, as he embarks on a transformative journey in search of his Personal Legend. Through encounters with mystical figures and unforeseen challenges, Santiago learns valuable lessons about following one's dreams and listening to the whispers of the heart. With its timeless wisdom and enchanting storytelling, The Alchemist continues to resonate with readers of all ages, reminding them that the true treasure lies within.",
    "totalPages": 208,
    "rating": 4.7,
    "category": "Fiction",
    "tags": [
      "Adventure",
      "Philosophical"
    ],
    "publisher": "HarperCollins",
    "yearOfPublishing": 1988
  },
  {
    "bookId": 9,
    "bookName": "Harry Potter and the Sorcerer's Stone",
    "author": "J.K. Rowling",
    "image": "harry_potter_sorcerers_stone.jpg",
    "review": "Harry Potter and the Sorcerer's Stone is a magical tale of friendship, courage, and adventure that has captured the imagination of readers worldwide. J.K. Rowling's enchanting narrative follows young Harry Potter as he discovers his true identity as a wizard and embarks on his journey to Hogwarts School of Witchcraft and Wizardry. Alongside his loyal friends Ron and Hermione, Harry navigates the challenges of wizarding life, facing dark forces and uncovering long-hidden secrets. With its captivating world-building and memorable characters, Harry Potter and the Sorcerer's Stone marks the beginning of an unforgettable literary phenomenon.",
    "totalPages": 320,
    "rating": 4.8,
    "category": "Fantasy",
    "tags": [
      "Magic",
      "Friendship"
    ],
    "publisher": "Bloomsbury Publishing",
    "yearOfPublishing": 1997
  }
]